MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32MC503/mcu.h
#define _C1VEC_ICODE2_POSITION                   0x00000002
#define _C1VEC_ICODE2_MASK                       0x00000004
#define _C1VEC_ICODE2_LENGTH                     0x00000001

#define _C1VEC_ICODE3_POSITION                   0x00000003
#define _C1VEC_ICODE3_MASK                       0x00000008
#define _C1VEC_ICODE3_LENGTH                     0x00000001

#define _C1VEC_ICODE4_POSITION                   0x00000004
#define _C1VEC_ICODE4_MASK                       0x00000010
#define _C1VEC_ICODE4_LENGTH                     0x00000001

#define _C1VEC_ICODE5_POSITION                   0x00000005
#define _C1VEC_ICODE5_MASK                       0x00000020
#define _C1VEC_ICODE5_LENGTH                     0x00000001

#define _C1VEC_ICODE6_POSITION                   0x00000006
#define _C1VEC_ICODE6_MASK                       0x00000040
#define _C1VEC_ICODE6_LENGTH                     0x00000001

#define _C1VEC_FILHIT0_POSITION                  0x00000008
#define _C1VEC_FILHIT0_MASK                      0x00000100
#define _C1VEC_FILHIT0_LENGTH                    0x00000001

#define _C1VEC_FILHIT1_POSITION                  0x00000009
#define _C1VEC_FILHIT1_MASK                      0x00000200
#define _C1VEC_FILHIT1_LENGTH                    0x00000001

#define _C1VEC_FILHIT2_POSITION                  0x0000000A
#define _C1VEC_FILHIT2_MASK                      0x00000400
#define _C1VEC_FILHIT2_LENGTH                    0x00000001

#define _C1VEC_FILHIT3_POSITION                  0x0000000B
#define _C1VEC_FILHIT3_MASK                      0x00000800
#define _C1VEC_FILHIT3_LENGTH                    0x00000001

#define _C1VEC_FILHIT4_POSITION                  0x0000000C
#define _C1VEC_FILHIT4_MASK                      0x00001000
#define _C1VEC_FILHIT4_LENGTH                    0x00000001

#define _C1FCTRL_FSA_POSITION                    0x00000000
#define _C1FCTRL_FSA_MASK                        0x0000001F
#define _C1FCTRL_FSA_LENGTH                      0x00000005

#define _C1FCTRL_DMABS_POSITION                  0x0000000D
#define _C1FCTRL_DMABS_MASK                      0x0000E000
#define _C1FCTRL_DMABS_LENGTH                    0x00000003

#define _C1FCTRL_FSA0_POSITION                   0x00000000
#define _C1FCTRL_FSA0_MASK                       0x00000001
#define _C1FCTRL_FSA0_LENGTH                     0x00000001

#define _C1FCTRL_FSA1_POSITION                   0x00000001
#define _C1FCTRL_FSA1_MASK                       0x00000002
#define _C1FCTRL_FSA1_LENGTH                     0x00000001

#define _C1FCTRL_FSA2_POSITION                   0x00000002
#define _C1FCTRL_FSA2_MASK                       0x00000004
#define _C1FCTRL_FSA2_LENGTH                     0x00000001

#define _C1FCTRL_FSA3_POSITION                   0x00000003
#define _C1FCTRL_FSA3_MASK                       0x00000008
#define _C1FCTRL_FSA3_LENGTH                     0x00000001

#define _C1FCTRL_FSA4_POSITION                   0x00000004
#define _C1FCTRL_FSA4_MASK                       0x00000010
#define _C1FCTRL_FSA4_LENGTH                     0x00000001

#define _C1FCTRL_DMABS0_POSITION                 0x0000000D
#define _C1FCTRL_DMABS0_MASK                     0x00002000
#define _C1FCTRL_DMABS0_LENGTH                   0x00000001

#define _C1FCTRL_DMABS1_POSITION                 0x0000000E
#define _C1FCTRL_DMABS1_MASK                     0x00004000
#define _C1FCTRL_DMABS1_LENGTH                   0x00000001

#define _C1FCTRL_DMABS2_POSITION                 0x0000000F
#define _C1FCTRL_DMABS2_MASK                     0x00008000
#define _C1FCTRL_DMABS2_LENGTH                   0x00000001

#define _C1FIFO_FNRB_POSITION                    0x00000000
#define _C1FIFO_FNRB_MASK                        0x0000003F
#define _C1FIFO_FNRB_LENGTH                      0x00000006

#define _C1FIFO_FBP_POSITION                     0x00000008
#define _C1FIFO_FBP_MASK                         0x00003F00
#define _C1FIFO_FBP_LENGTH                       0x00000006

#define _C1FIFO_FNRB0_POSITION                   0x00000000
#define _C1FIFO_FNRB0_MASK                       0x00000001
#define _C1FIFO_FNRB0_LENGTH                     0x00000001

#define _C1FIFO_FNRB1_POSITION                   0x00000001
#define _C1FIFO_FNRB1_MASK                       0x00000002
#define _C1FIFO_FNRB1_LENGTH                     0x00000001

#define _C1FIFO_FNRB2_POSITION                   0x00000002
#define _C1FIFO_FNRB2_MASK                       0x00000004
#define _C1FIFO_FNRB2_LENGTH                     0x00000001

#define _C1FIFO_FNRB3_POSITION                   0x00000003
#define _C1FIFO_FNRB3_MASK                       0x00000008
#define _C1FIFO_FNRB3_LENGTH                     0x00000001

#define _C1FIFO_FNRB4_POSITION                   0x00000004
#define _C1FIFO_FNRB4_MASK                       0x00000010
#define _C1FIFO_FNRB4_LENGTH                     0x00000001

#define _C1FIFO_FNRB5_POSITION                   0x00000005
#define _C1FIFO_FNRB5_MASK                       0x00000020
#define _C1FIFO_FNRB5_LENGTH                     0x00000001

#define _C1FIFO_FBP0_POSITION                    0x00000008
#define _C1FIFO_FBP0_MASK                        0x00000100
#define _C1FIFO_FBP0_LENGTH                      0x00000001

#define _C1FIFO_FBP1_POSITION                    0x00000009
#define _C1FIFO_FBP1_MASK                        0x00000200
#define _C1FIFO_FBP1_LENGTH                      0x00000001

#define _C1FIFO_FBP2_POSITION                    0x0000000A
#define _C1FIFO_FBP2_MASK                        0x00000400
#define _C1FIFO_FBP2_LENGTH                      0x00000001

#define _C1FIFO_FBP3_POSITION                    0x0000000B
#define _C1FIFO_FBP3_MASK                        0x00000800
#define _C1FIFO_FBP3_LENGTH                      0x00000001

#define _C1FIFO_FBP4_POSITION                    0x0000000C
#define _C1FIFO_FBP4_MASK                        0x00001000
#define _C1FIFO_FBP4_LENGTH                      0x00000001

#define _C1FIFO_FBP5_POSITION                    0x0000000D
#define _C1FIFO_FBP5_MASK                        0x00002000
#define _C1FIFO_FBP5_LENGTH                      0x00000001

#define _C1INTF_TBIF_POSITION                    0x00000000
#define _C1INTF_TBIF_MASK                        0x00000001
#define _C1INTF_TBIF_LENGTH                      0x00000001

#define _C1INTF_RBIF_POSITION                    0x00000001
#define _C1INTF_RBIF_MASK                        0x00000002
#define _C1INTF_RBIF_LENGTH                      0x00000001

